[
  {
    "verse": "You have the right to work, but never to the fruit of work.",
    "chapter": 2,
    "verseNumber": 47,
    "meaning": "Focus on your actions, not on the results."
  },
  {
    "verse": "The soul is neither born, nor does it die.",
    "chapter": 2,
    "verseNumber": 20,
    "meaning": "The soul is eternal and indestructible."
  },
  {
    "verse": "Change is the law of the universe. You can be a millionaire, or a pauper in an instant.",
    "chapter": 2,
    "verseNumber": 14,
    "meaning": "Everything in life is temporary; embrace change."
  },
  {
    "verse": "A person can rise through the efforts of his own mind; or draw himself down, in the same manner.",
    "chapter": 6,
    "verseNumber": 5,
    "meaning": "You are your own best friend or your own worst enemy."
  },
  {
    "verse": "When meditation is mastered, the mind is unwavering like the flame of a lamp in a windless place.",
    "chapter": 6,
    "verseNumber": 19,
    "meaning": "True meditation brings stillness and inner peace."
  },
  {
    "verse": "He who has no attachments can really love others, for his love is pure and divine.",
    "chapter": 3,
    "verseNumber": 25,
    "meaning": "Selfless love comes from detachment and understanding."
  },
  {
    "verse": "Perform your duty and abandon all attachment to success or failure.",
    "chapter": 2,
    "verseNumber": 48,
    "meaning": "Balance in success and failure is the mark of true wisdom."
  },
  {
    "verse": "The mind is restless and difficult to restrain, but it is subdued by practice.",
    "chapter": 6,
    "verseNumber": 35,
    "meaning": "With consistent discipline, even the restless mind can be tamed."
  },
  {
    "verse": "Whatever action is performed by a great man, common men follow in his footsteps.",
    "chapter": 3,
    "verseNumber": 21,
    "meaning": "Your actions inspire others; act with integrity."
  },
  {
    "verse": "For one who has conquered his mind, the mind is the best of friends; but for one who has failed to do so, his mind will remain the greatest enemy.",
    "chapter": 6,
    "verseNumber": 6,
    "meaning": "Master your mind, and you master your life."
  },
  {
    "verse": "The self-controlled soul, who moves amongst sense objects, free from attachment and aversion, attains peace.",
    "chapter": 2,
    "verseNumber": 64,
    "meaning": "Peace arises from self-control and detachment."
  },
  {
    "verse": "Delusion arises from anger. The mind is bewildered by delusion.",
    "chapter": 2,
    "verseNumber": 63,
    "meaning": "Anger clouds judgment and leads to self-destruction."
  },
  {
    "verse": "As a person puts on new garments, giving up old ones, the soul similarly accepts new material bodies.",
    "chapter": 2,
    "verseNumber": 22,
    "meaning": "Death is not the end; it’s a change of form."
  },
  {
    "verse": "The wise see knowledge and action as one and the same.",
    "chapter": 4,
    "verseNumber": 18,
    "meaning": "Wisdom lies in seeing the unity between knowing and doing."
  },
  {
    "verse": "When a person responds to the joys and sorrows of others as if they were his own, he has attained the highest spiritual union.",
    "chapter": 6,
    "verseNumber": 32,
    "meaning": "Empathy is the true mark of enlightenment."
  },
  {
    "verse": "Those who are motivated only by desire for the fruits of action are miserable, for they are constantly anxious about the results.",
    "chapter": 2,
    "verseNumber": 49,
    "meaning": "Attachment to results brings anxiety; freedom comes from detachment."
  },
  {
    "verse": "Just as fire is covered by smoke, mirror by dust, and embryo by the womb, knowledge is covered by desire.",
    "chapter": 3,
    "verseNumber": 38,
    "meaning": "Desire clouds wisdom; self-control reveals truth."
  },
  {
    "verse": "The senses are superior to the body, but superior to the senses is the mind; superior to the mind is the intellect, and superior to the intellect is the self.",
    "chapter": 3,
    "verseNumber": 42,
    "meaning": "True mastery begins from within, not from the external world."
  },
  {
    "verse": "A person is said to be elevated when they renounce all desires and act without selfish motives.",
    "chapter": 6,
    "verseNumber": 4,
    "meaning": "Spiritual progress means transcending desire."
  },
  {
    "verse": "One who sees inaction in action, and action in inaction, is intelligent among men.",
    "chapter": 4,
    "verseNumber": 18,
    "meaning": "Wisdom is seeing beyond the surface of actions."
  },
  {
    "verse": "The wise work without attachment, surrendering the fruits of their work to God.",
    "chapter": 2,
    "verseNumber": 50,
    "meaning": "Selfless work leads to liberation."
  },
  {
    "verse": "Faith is born of the self; a person is what his faith is.",
    "chapter": 17,
    "verseNumber": 3,
    "meaning": "Your faith shapes your reality."
  },
  {
    "verse": "When your mind has overcome the confusion of duality, you will attain the state of pure consciousness.",
    "chapter": 2,
    "verseNumber": 52,
    "meaning": "Transcend opposites like joy and sorrow to find peace."
  },
  {
    "verse": "The one who sees inaction in action and action in inaction is truly wise.",
    "chapter": 4,
    "verseNumber": 18,
    "meaning": "Spiritual intelligence is seeing the divine in every act."
  },
  {
    "verse": "No one who does good work will ever come to a bad end, either here or in the world to come.",
    "chapter": 6,
    "verseNumber": 40,
    "meaning": "Good actions always bear positive fruit, even if unseen."
  },
  {
    "verse": "To those who are constantly devoted and who worship Me with love, I give the understanding by which they can come to Me.",
    "chapter": 10,
    "verseNumber": 10,
    "meaning": "Devotion and love lead to divine wisdom."
  },
  {
    "verse": "Among thousands of men, one may strive for perfection; and among those who strive, only a few truly know Me.",
    "chapter": 7,
    "verseNumber": 3,
    "meaning": "True realization is rare and precious."
  },
  {
    "verse": "I am the taste in water, the light in the moon and the sun, the sound in air, and the life of all beings.",
    "chapter": 7,
    "verseNumber": 8,
    "meaning": "The divine presence pervades all of creation."
  },
  {
    "verse": "To the pure-hearted, everything is pure; to the impure, everything is impure.",
    "chapter": 17,
    "verseNumber": 16,
    "meaning": "Perception depends on the purity of one’s heart."
  },
  {
    "verse": "The peace of God is with them whose mind and soul are in harmony, who are free from desire and wrath.",
    "chapter": 2,
    "verseNumber": 70,
    "meaning": "Inner harmony brings divine peace."
  }
]
